Revit 2027 API
ExternalFileReferenceType Enumeration
 Enum class indicating kinds of external file references
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ExternalFileReferenceType
Public Enumeration ExternalFileReferenceType
public enum class ExternalFileReferenceType
type ExternalFileReferenceType
Members
Member name | Value | Description
AssemblyCodeTable | 7 |  The assembly code table (The file which contains assembly code information.)
CADLink | 2 |  Linked CAD files
Decal | 5 |  Decals (images which appear only during rendering)
DWFMarkup | 3 |  DWF markup files
KeynoteTable | 4 |  The keynote table (The file which contains keynote information.)
Material | 6 |  Materials are not included as ExternalFileReferences in the 2012 release
None | 0 |  Uninitialized value
RevitLink | 1 |  Revit linked files
SystemsAnalysisReport | 12 |  Systems analysis report file path
See Also
Reference
Autodesk.Revit.DB Namespace